<template><PageView>
    <template #title>「iAiA」利用規約</template>

    <h2>1. ご利用にあたって</h2>
    <p>この利用規約（以下、「本規約」といいます。）は、「iAiA」アプリ運営者（以下、「運営者」といいます。）がこのアプリ上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。このアプリ (<a href="https://iaia.app">https://iaia.app</a>、以下「本アプリ」といいます。）のご利用にあたっては、事前にこの利用規約（以下「本規約」といいます。）をご一読頂き、同意された場合にのみご利用下さい。運営者は、予告なく本規約の内容を変更する場合がありますので、あらかじめご了承下さい。</p>

    <h2>2. 禁止事項</h2>
    <ol>
      <li>本アプリのご利用に際し、次の行為は、禁止させていただきます。
        <ol>
          <li>運営者または第三者の財産もしくはプライバシーなどを侵害する行為、または侵害する恐れのある行為</li>
          <li>運営者または第三者に、不利益もしくは損害を与える行為、またはその恐れのある行為</li>
          <li>公序良俗に反する行為、またはその恐れのある行為</li>
          <li>犯罪行為もしくは犯罪行為に結びつく行為、またはその恐れのある行為</li>
          <li>営業活動もしくは営利を目的とする行為、またはその準備を目的とする行為</li>
          <li>他人の電子メールアドレスを登録するなど、虚偽の申告、届出を行なう行為</li>
          <li>コンピュータウィルス等有害なプログラムを使用または提供する行為</li>
          <li>その他、法律、法令もしくは条例に違反する行為、またはその恐れのある行為</li>
          <li>その他、運営者が不適切と判断する行為</li>
        </ol>
      </li>
      <li>運営者は、上記の禁止行為を発見した場合、お客様に事前に通知することなく、その全部または一部を削除することがありますが、常に本アプリを監視する義務を負うものではありません。</li>
    </ol>

    <h2>3. 著作権等について</h2>
    <p>本アプリに掲載されている情報に関わる著作権その他の権利は、運営者または運営者に使用を認めた権利者に帰属しますので、私的使用など法律によって認められる範囲を超えて、無断で使用（複製、改ざん、頒布などを含む。）することはできません。</p>

    <h2>4. 免責事項について</h2>
    <ol>
      <li>運営者は、本アプリに掲載されている全ての情報を慎重に作成し、また管理しますが、その正確性および完全性などに関して、いかなる保証もするものではありません。</li>
      <li>運営者は、予告なしに、本アプリの運営を停止または中止し、また本アプリに掲載されている情報の全部または一部を変更する場合があります。</li>
      <li>お客様が本アプリをご利用されたこと、または何らかの原因によりこれをご利用できなかったことによりお客様に生じる一切の損害について、運営者は、何ら責任を負うものではありません。</li>
    </ol>

    <h2>5. 推奨環境</h2>
    <p>本アプリをご覧になる際には、下記環境をご利用されることを推奨いたします。推奨環境以外では、当サイトの一部がご利用いただけないことがあります。</p>
    <ul>
      <li>iOS12 以上のバージョン</li>
      <li>android OS 8 以上のバージョン</li>
      <li>Windows 10 以上のバージョンかつChrome 70 以上のバージョン</li>
      <li>MacOS 12 以上のバージョンかつChrome 70 以上のバージョン</li>
    </ul>

    <h2>6. リンクサイトについて</h2>
    <p>本アプリから、または本アプリへリンクを張っている第三者のウェブサイト（以下「リンクサイト」といいます。）の内容およびリンクサイトの利用により生じる一切の損害について、運営者は、いかなる責任も負うものではありません。<br>
    本アプリへのリンクは原則として自由ですが、リンクされているウェブサイトの内容（公序良俗に反するなど）やリンクの方法によっては、事前事後にかかわらず、リンクをお断りする場合があります。</p>

    <h2>7. クッキー(Cookie)</h2>
    <ol>
      <li>本アプリでは、次の目的で、「クッキー(cookie)」と呼ばれる技術を使用する場合があります。
        <ol>
          <li>お客様が本アプリに再訪問された際、より便利に本アプリをご利用いただくため</li>
          <li>本アプリの利用状況を計測・分析するため</li>
        </ol>
      </li>
      <li>お客様がクッキーを発行するコンテンツをご訪問された場合、お客様のコンピュータにクッキーが記録されますが、記録される情報には、お客様個人を識別できる情報は一切含まれていません。</li>
      <li>お客様ご自身でブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本アプリの一部がご利用できなくなることがあります。</li>
    </ol>

    <h2>8. 準拠法・管轄裁判所について</h2>
    <ol>
      <li>本アプリおよび本規約の解釈および運用は、日本法に準拠します。</li>
      <li>本アプリおよび本規約に関わる紛争は、東京地方裁判所を第一審の専属管轄裁判所とします。</li>
    </ol>

    <h2>9. WEB解析ツールについて</h2>
    <p>本アプリの一部では、お客様により使い易く、有用な情報サービスを提供させていただくため、ユーザーの情報を Google Analytics を使って収集しています。</p>

    <h2>10. アフィリエイトについて</h2>
    <p>本アプリでは広告が表示されることがあります。リンク先のサービスや商品は本アプリが関係しているものではありません。また、サービス利用時や商品などの購入に関するトラブルに関して当アプリは一切責任を負いませんのでご了承ください。</p>

</PageView></template>


<script lang="ts">
import { Component, Vue } from 'vue-property-decorator';
import PageView from '@/components/PageView.vue';

@Component({
  components: {
    PageView,
  },
})
export default class Term extends Vue {
}
</script>


<style scoped lang="scss">
@import "@/scss/common.scss";
</style>
